app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
---
  def show
    @usuario = Usuario.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
---
  def edit
    @usuario = Usuario.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
UPDATE "usuarios" SET "encrypted_password" = '$2a$10$67nq7f8nTjcPVZaVV3Ct7efQGvlhHIp9vVDtVnV7n1xU0U.qNK2cO', "updated_at" = '2011-10-24 14:20:13.449777' WHERE "usuarios"."id" = 1
---
  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])